Revit 2026 API

# BuiltInFailuresUniqueElementFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresUniqueElementFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class UniqueElementFailures
```
```vb
Public NotInheritable Class UniqueElementFailures
```
```cpp
public ref class UniqueElementFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UniqueElementFailures = class end
```

The BuiltInFailuresUniqueElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ProhibitUniqueElementDeletion | Internal setting '%1!s!' is required by Revit and has been deleted. |

#### Reference

Autodesk.Revit.DB Namespace